import matplotlib.pyplot as plt
from matplotlib_venn import venn2
 
v = venn2(subsets = (1, 1,1), set_labels = ('Рослинне походження', 'Не гострий'))

v.get_label_by_id('10').set_text('1.Гірчиця. \n 2. Перець Чілі \n 3. Хрін')
v.get_label_by_id('01').set_text('1.Майонез \n 2. Сир')
v.get_label_by_id('11').set_text('1.Кетчуп \n 2. Огірок')
plt.show()


# Кетчуп - з помідорів, приправа, не гострий, Рослинне походження
# Майонез - з яєць, приправа, не гострий, не твраенне походження
# Гірчиця - гостра, з гірчиці, рослинне походження.

# ? рослинне походження
# ? Не гострий


